# Pandas Week 5 - Joshua Lewi (2473018)

### 17.  Resampling pada data deret waktu (time series data)

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

In [37]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     col1  col2
2000-01-01 00:00:00     4    13
2000-01-01 01:00:00     6    12
2000-01-01 02:00:00    19     9
2000-01-01 03:00:00    12     8
2000-01-01 04:00:00    19    16
...                   ...   ...
2000-12-30 19:00:00     1     7
2000-12-30 20:00:00    10    10
2000-12-30 21:00:00    16    19
2000-12-30 22:00:00    15    15
2000-12-30 23:00:00     6    16

[8760 rows x 2 columns]

Resampling dengan interval monthly

In [38]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7156
2000-02-29  6769
2000-03-31  7269
2000-04-30  7177
2000-05-31  7361
2000-06-30  7213
2000-07-31  7350
2000-08-31  7538
2000-09-30  7208
2000-10-31  7332
2000-11-30  7354
2000-12-31  7498

Resample data dengan interval daily

In [39]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   268
2000-01-02   259
2000-01-03   279
2000-01-04   223
2000-01-05   240
...          ...
2000-12-26   239
2000-12-27   269
2000-12-28   264
2000-12-29   280
2000-12-30   269

[365 rows x 1 columns]

## 18. Membentuk dummy data frame

In [40]:
pd.DataFrame({'col1': [1, 2, 3, 4],
              'col2': [5, 6, 7, 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

Ngebentuk data frame dari Numpy Array

In [41]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[ 9,  8, 11],
       [19,  2, 11],
       [ 5, 15,  1],
       [17,  1,  2],
       [12,  1,  1]])

Membentuk data frame dengan memanfaatkan pandas.util.testing

In [42]:
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
4FyiLciNT1 -1.084645 -0.428486 -0.351501  0.416512
NlFDfuiFY8 -0.914848 -0.430163 -1.485687  1.914351
4W7XWQaftq  0.889708 -0.599317  0.958160 -0.161929
gawaWiBkMX  0.103115  1.418792  0.265297 -0.185012
3tRFBEiYM9 -0.050687  0.030747  0.645829 -1.051186

In [43]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [44]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03 -3.107194 -0.017939 -0.066585 -1.223861
2000-01-04 -0.267794  0.913796  1.912792  0.915942
2000-01-05  2.426077 -1.685510 -1.074603 -0.378166
2000-01-06  0.517596 -0.938457 -0.574599 -0.039515
2000-01-07 -0.652012 -0.485729 -0.072788  0.419540

In [45]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
czmiHvxBSf -0.274945  0.008074  0.661272 -0.320761
TkWA0gdn6X  1.447662  0.634250       NaN -0.734522
yMRLSPme4L  0.048318 -0.864887  0.221556 -0.482981
LCRD5q7SLY  0.597430 -0.744801  0.906068 -0.116121
6AQ7pfekZN  0.721171 -2.561563  0.024334  1.118295

## 19. Formatting tampilan Data frame

In [46]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df

   omset  operasional
0      6            7
1      1            1
2     17           16
3      6            1
4     11            1

In [47]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   600000        70000
1   100000        10000
2  1700000       160000
3   600000        10000
4  1100000        10000

In [48]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   600000        70000
1 2000-01-02   100000        10000
2 2000-01-03  1700000       160000
3 2000-01-04   600000        10000
4 2000-01-05  1100000        10000

Melakukan Formatting tampilan Data Frame

In [49]:
formatku = {'tanggal':'{:%d/%m/%y}',
            'operasional':'Rp {:.2f}',
            'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [50]:
type(laporan)

pandas.io.formats.style.Styler

In [51]:
laporan.hide_index()

In [52]:
laporan.set_caption('Data Omset dan Operasional')

In [53]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

## 20. Menggabungkan (merge) 2 data frame secara berdampingan

In [54]:
d1 = {'col1':[1, 2, 3],
      'col2':[10, 20, 30]}
df1 = pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [55]:
d2 = {'col3':[4, 5, 6],
      'col4':[40, 50, 60]}
df2 = pd.DataFrame(d2)
df2

   col3  col4
0     4    40
1     5    50
2     6    60

In [56]:
df = pd.merge(df1, df2, left_index=True, right_index=True)
df

   col1  col2  col3  col4
0     1    10     4    40
1     2    20     5    50
2     3    30     6    60